ji6czd/momo/momors/crates/momors-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# 手元のボードはチップ改版 v1.3。ESP-IDF v5.5 の既定は v3.01 以上向けで RAM 配置が異なり、
# そのブートローダは v1.x チップでは起動しない。
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
# v1.x チップは 360MHz 固定。CONFIG_ESP_FORCE_400MHZ_ON_REV_LESS_V3 + ESP_DEFAULT_CPU_FREQ_MHZ_400 を
# 試したが v1.3 では esp_clk_init の assert (clk.c:142) で起動しない（2026-09-04 実測）。

# ---- キャッシュ ----
# 512KB → 256KB（ライン幅 128B は据え置き、サイズだけ変えて切り分け）を現行コードで実機比較
# （2026-09-11、bench-tools 有効ビルド、:bench 20 / :probe / :feed+:tp 50、内部 SRAM は heap:
# internal の起動直後の値）:
#   512KB: bench 401 us/文字, probe合計 322 us/文字, tp 465 us/文字 (2,152 字/秒, 100枚 18.6秒),
#          内部SRAM 151.8KB
#   256KB: bench 452 us/文字, probe合計 361 us/文字, tp 509 us/文字 (1,966 字/秒, 100枚 20.3秒),
#          内部SRAM 406.9KB（+255KB、ほぼ差分どおり）
# 速度は約 9〜13% 悪化するが、目標の 1〜2 ms/文字には両方とも十分収まる。内部 SRAM が
# 255KB 増えるメリット（スタック削減の 32KB よりずっと大きく、他アプリにも効く）の方が勝るため
# 256KB を採用。過去の 128KB→512KB 実測（docs/esp32p4-plan.md、predict 2,997→1,643 us/文字）
# ほど極端ではなかった（あの実測はライン幅も同時に変えていたため単純比較はできない）。
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ---- フラッシュ / パーティション ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
# 既定は DIO（80MHz で 20MB/s）。アプリはフラッシュから XIP 実行し、モデルも 12MB を
# フラッシュから読むので、帯域が倍になる QIO にする。
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHMODE="qio"
# パーティション表は espflash 書き込み時に partitions.csv を渡す（.cargo/config.toml の runner 参照）。
# ESP-IDF 側の CONFIG_PARTITION_TABLE_CUSTOM は CMake プロジェクトが out dir に置かれるため使わない。

# ---- PSRAM (32MB) をヒープとして使う ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
# 0 = 大きさにかかわらず PSRAM を優先する。モデルは小さな確保（クラス表の String・GBDT の
# Box ノード・辞書）を大量に行い、既定の 4096 では内部 SRAM 380KB を使い切って
# 直後の pthread mutex 生成で落ちた（2026-09-04 実測）。
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
# CONFIG_SPIRAM_XIP_FROM_PSRAM（アプリの .text/.rodata を PSRAM から実行）は **試して却下**。
# ライン充填はフラッシュ QIO 3.2µs > PSRAM 1µs なので速くなるはずだったが、実測は
# 4万字 22.0 → 23.2 秒と悪化した（2026-09-05）。命令フェッチが、モデルを読む
# データアクセスと同じ PSRAM バスを奪い合うため。フラッシュに置いたままなら
# 命令フェッチ（SPI フラッシュ）とデータ（PSRAM）が別バスで並行できる。
# CONFIG_SPIRAM_MEMTEST=n（起動時の PSRAM 全面テストを切る）も試したが、main 到達まで
# 50ms で変化なし。既定のままにする。起動時間の内訳は当初 50ms(初期化) + 132ms(点字テーブル)
# + 1,023ms(モデル展開) だったが、その後のモデル側最適化で 51ms + 88ms + 642ms ≒ 780ms に縮んだ
# （2026-09-11、256KB キャッシュでの実測。削るならまだモデル展開が本命）。
# 内部 SRAM は ESP-IDF の内部専用確保（DMA・FreeRTOS オブジェクト）のために予約する。
# L2 キャッシュ 256KB にすると内部 SRAM は約 400KB 残る（512KB のときは約 150KB）ので、
# 予約は小さめのままで足りる。
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ---- スタック ----
# 実測ピーク（TOML/serde 解析 + モデル展開 + 推論）は 17.0KB（`stack_summary()` の :stat 表示、
# 2026-09-11 実機測定）。約 1.9 倍の余裕を見て 32KB にした。内部 SRAM は主タスクのスタックからしか
# 取れない（FreeRTOSConfig.h の configSTACK_ALLOCATION_FROM_SEPARATE_HEAP=0 経由で
# MALLOC_CAP_INTERNAL 固定）ため、64KB からの削減分がそのまま内部 SRAM の空きに戻る。
# オーバーフローは静かに壊れず ESP-IDF 既定のカナリア方式で vApplicationStackOverflowHook に落ちる。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# ---- コンソール: USB-Serial-JTAG ----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- 1 文の推論が長引いてもタスク WDT に殺されないようにする ----
CONFIG_ESP_TASK_WDT_INIT=n
